In [2]:
import pandas as pd

In [4]:
pd.__version__

'2.2.3'

In [6]:
lst = [1,2,3,4,5,6,7,8,9]
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [8]:
series = pd.Series(lst)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
empty = pd.Series([])
print(empty)

Series([], dtype: object)

In [10]:
a = pd.Series(['a','b','c'],index=[10,20,30])
print(a)

10    a
20    b
30    c
dtype: object

In [11]:
a = pd.Series(['a','b','c'],index=[10,20,30],name='isha')
print(a)

10    a
20    b
30    c
Name: isha, dtype: object

In [12]:
scalar_series = pd.Series(0.5)
print(scalar_series)

0    0.5
dtype: float64

In [13]:
scalar_series = pd.Series(0.5,index=[10,20,30])
print(scalar_series)

10    0.5
20    0.5
30    0.5
dtype: float64

In [15]:
#pandas series with python dictionary

dic_series = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5,'f':6})
print(dic_series)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [23]:
dic_series[0]

C:\Users\HP\AppData\Local\Temp\ipykernel_20600\2461307020.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dic_series[0]

np.int64(1)

In [24]:
max(dic_series)

6

In [26]:
dic_series[0:3]

a    1
b    2
c    3
dtype: int64

In [28]:
dict_series = pd.Series({'a':[1,2,3] , 'b':[5,6,7] , 'c':[8,9,10]})
print(dict_series)

a     [1, 2, 3]
b     [5, 6, 7]
c    [8, 9, 10]
dtype: object

In [30]:
 #DataFrame
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [31]:
lst = [1,2,3,4,5]
print(lst)

[1, 2, 3, 4, 5]

In [32]:
df = pd.DataFrame(lst)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [38]:
lst = [[1,2,3,4,5],[11,12,13,14,15],[16,17,18,19,20]]
df = pd.DataFrame(lst)
print(df)

    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15
2  16  17  18  19  20

In [42]:
a = [{'a' : 1 , 'b' : 2 , 'c':3},{'a':4,'b':5,'c':6}]
df = pd.DataFrame(a)
print(df)

   a  b  c
0  1  2  3
1  4  5  6

In [47]:
b={'rollnp' : pd.Series([1,2,3,4,5]),
  'maths': pd.Series([11,12,13,14,15]),
  'physics' : pd.Series([16,17,18,19,20])}
df = pd.DataFrame(b)
print(df)

   rollnp  maths  physics
0       1     11       16
1       2     12       17
2       3     13       18
3       4     14       19
4       5     15       20

In [54]:
#Reading CSV(Common Separated Values)as DataFrames
df = pd.read_csv(r"C:\Users\HP\Downloads\Book1.csv")
print(df)

    year  salary
0    1.6   40000
1    6.3  100000
2    4.2   90000
3    6.3  100000
4    5.2   90500
5    3.3    6000
6    5.2    2000
7    4.1    4569
8    2.6   85369
9    8.9   54213
10   4.2   69875

In [55]:
type(df)

pandas.core.frame.DataFrame

In [56]:
df.columns

Index(['year', 'salary'], dtype='object')

In [57]:
df.shape

(11, 2)

In [58]:
df.size

22

In [59]:
df.head()

   year  salary
0   1.6   40000
1   6.3  100000
2   4.2   90000
3   6.3  100000
4   5.2   90500

In [60]:
df.tail()

    year  salary
6    5.2    2000
7    4.1    4569
8    2.6   85369
9    8.9   54213
10   4.2   69875

In [61]:
df.head(4)

   year  salary
0   1.6   40000
1   6.3  100000
2   4.2   90000
3   6.3  100000

In [62]:
df.describe()

            year         salary
count  11.000000      11.000000
mean    4.718182   58411.454545
std     2.002408   39407.713297
min     1.600000    2000.000000
25%     3.700000   23000.000000
50%     4.200000   69875.000000
75%     5.750000   90250.000000
max     8.900000  100000.000000

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    11 non-null     float64
 1   salary  11 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 308.0 bytes

In [3]:
#handling the null value
df = pd.read_csv(r"C:\Users\HP\Downloads\Book2.csv")
print(df)

   roll no  maths  physics  chemistry
0        1   50.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      NaN       41.0
4        5   45.0      8.0        2.0
5        6   23.0      NaN        NaN
6        7    NaN      9.0        NaN
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      NaN       12.0

In [4]:
df.head()

   roll no  maths  physics  chemistry
0        1   50.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      NaN       41.0
4        5   45.0      8.0        2.0

In [66]:
df.isnull()

   roll no  maths  physics  chemistry
0    False  False     True      False
1    False  False    False      False
2    False  False    False      False
3    False  False     True      False
4    False  False    False      False
5    False  False     True       True
6    False   True    False       True
7    False  False    False      False
8    False  False    False      False
9    False  False     True      False

In [5]:
df.isnull().sum()

roll no      0
maths        1
physics      4
chemistry    2
dtype: int64

In [68]:
df.isnull().sum().sum()

np.int64(7)

In [69]:
df.shape

(10, 4)

In [73]:
df2 = df.dropna()

In [75]:
df2 = df.dropna(axis=1)

In [76]:
df2.shape

(10, 1)

In [77]:
df.dropna(how='any')

   roll no  maths  physics  chemistry
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
4        5   45.0      8.0        2.0
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0

In [78]:
df.shape

(10, 4)

In [80]:
df.dropna(how='all')

   roll no  maths  physics  chemistry
0        1   50.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      NaN       41.0
4        5   45.0      8.0        2.0
5        6   23.0      NaN        NaN
6        7    NaN      9.0        NaN
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      NaN       12.0

In [81]:
df.shape

(10, 4)

In [82]:
df.dropna(inplace=True)

In [83]:
df.shape

(5, 4)

In [6]:
#part5   fiiling the null values
df.fillna(0)

   roll no  maths  physics  chemistry
0        1   50.0      0.0        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      0.0       41.0
4        5   45.0      8.0        2.0
5        6   23.0      0.0        0.0
6        7    0.0      9.0        0.0
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      0.0       12.0

In [7]:
df.fillna(2)

   roll no  maths  physics  chemistry
0        1   50.0      2.0        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      2.0       41.0
4        5   45.0      8.0        2.0
5        6   23.0      2.0        2.0
6        7    2.0      9.0        2.0
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      2.0       12.0

In [11]:
df.fillna({'physics' : 'none' , 'chemistry' : 'nan', 'maths' : 2})

   roll no  maths physics chemistry
0        1   50.0    none       5.0
1        2   53.0     2.0       6.0
2        3    6.0     6.0       3.0
3        4    9.0    none      41.0
4        5   45.0     8.0       2.0
5        6   23.0    none       nan
6        7    2.0     9.0       nan
7        8   69.0    41.0       6.0
8        9    5.0    26.0       5.0
9       10    6.0    none      12.0

In [12]:
df.fillna(method = 'ffill')

C:\Users\HP\AppData\Local\Temp\ipykernel_21308\2929764801.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill')

   roll no  maths  physics  chemistry
0        1   50.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      6.0       41.0
4        5   45.0      8.0        2.0
5        6   23.0      8.0        2.0
6        7   23.0      9.0        2.0
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0     26.0       12.0

In [13]:
df.fillna(method = 'ffill',axis=1)

C:\Users\HP\AppData\Local\Temp\ipykernel_21308\1437653045.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill',axis=1)

   roll no  maths  physics  chemistry
0      1.0   50.0     50.0        5.0
1      2.0   53.0      2.0        6.0
2      3.0    6.0      6.0        3.0
3      4.0    9.0      9.0       41.0
4      5.0   45.0      8.0        2.0
5      6.0   23.0     23.0       23.0
6      7.0    7.0      9.0        9.0
7      8.0   69.0     41.0        6.0
8      9.0    5.0     26.0        5.0
9     10.0    6.0      6.0       12.0

In [14]:
df.fillna(method = 'bfill')

C:\Users\HP\AppData\Local\Temp\ipykernel_21308\3953046274.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill')

   roll no  maths  physics  chemistry
0        1   50.0      2.0        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      8.0       41.0
4        5   45.0      8.0        2.0
5        6   23.0      9.0        6.0
6        7   69.0      9.0        6.0
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      NaN       12.0

In [15]:
df.fillna(method = 'bfill',axis=1)

C:\Users\HP\AppData\Local\Temp\ipykernel_21308\3085568247.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill',axis=1)

   roll no  maths  physics  chemistry
0      1.0   50.0      5.0        5.0
1      2.0   53.0      2.0        6.0
2      3.0    6.0      6.0        3.0
3      4.0    9.0     41.0       41.0
4      5.0   45.0      8.0        2.0
5      6.0   23.0      NaN        NaN
6      7.0    9.0      9.0        NaN
7      8.0   69.0     41.0        6.0
8      9.0    5.0     26.0        5.0
9     10.0    6.0     12.0       12.0

In [16]:
df['maths'].fillna(value = df['maths'].mean())

0    50.000000
1    53.000000
2     6.000000
3     9.000000
4    45.000000
5    23.000000
6    29.555556
7    69.000000
8     5.000000
9     6.000000
Name: maths, dtype: float64

In [19]:
df.fillna(method='bfill',inplace=True)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_21308\2066966601.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill',inplace=True)

   roll no  maths  physics  chemistry
0        1   50.0      2.0        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      8.0       41.0
4        5   45.0      8.0        2.0
5        6   23.0      9.0        6.0
6        7   69.0      9.0        6.0
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      NaN       12.0

In [20]:
#part6   replace function
df = pd.read_csv(r"C:\Users\HP\Downloads\Book2.csv")
print(df)

   roll no  maths  physics  chemistry
0        1   50.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      NaN       41.0
4        5   45.0      8.0        2.0
5        6   23.0      NaN        NaN
6        7    NaN      9.0        NaN
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      NaN       12.0

In [21]:
df.head()

   roll no  maths  physics  chemistry
0        1   50.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      NaN       41.0
4        5   45.0      8.0        2.0

In [22]:
df.replace(to_replace=50,value=100)

   roll no  maths  physics  chemistry
0        1  100.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      NaN       41.0
4        5   45.0      8.0        2.0
5        6   23.0      NaN        NaN
6        7    NaN      9.0        NaN
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      NaN       12.0

In [23]:
df.replace(100,50)

   roll no  maths  physics  chemistry
0        1   50.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      NaN       41.0
4        5   45.0      8.0        2.0
5        6   23.0      NaN        NaN
6        7    NaN      9.0        NaN
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      NaN       12.0

In [26]:
df.replace(to_replace=[50,53,45],value='A')

   roll no maths  physics  chemistry
0        1     A      NaN        5.0
1        2     A      2.0        6.0
2        3   6.0      6.0        3.0
3        4   9.0      NaN       41.0
4        5     A      8.0        2.0
5        6  23.0      NaN        NaN
6        7   NaN      9.0        NaN
7        8  69.0     41.0        6.0
8        9   5.0     26.0        5.0
9       10   6.0      NaN       12.0

In [28]:
df.replace(to_replace=[9,23,50],value=['f','b','a'])

  roll no maths physics  chemistry
0       1     a     NaN        5.0
1       2  53.0     2.0        6.0
2       3   6.0     6.0        3.0
3       4     f     NaN       41.0
4       5  45.0     8.0        2.0
5       6     b     NaN        NaN
6       7   NaN       f        NaN
7       8  69.0    41.0        6.0
8       f   5.0    26.0        5.0
9      10   6.0     NaN       12.0

In [29]:
df['maths'].replace(to_replace=[9,23,50],value=['f','b','a'])

0       a
1    53.0
2     6.0
3       f
4    45.0
5       b
6     NaN
7    69.0
8     5.0
9     6.0
Name: maths, dtype: object

In [32]:
df.replace('[A-Za-z]',0,regex = False)

   roll no  maths  physics  chemistry
0        1   50.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    9.0      NaN       41.0
4        5   45.0      8.0        2.0
5        6   23.0      NaN        NaN
6        7    NaN      9.0        NaN
7        8   69.0     41.0        6.0
8        9    5.0     26.0        5.0
9       10    6.0      NaN       12.0

In [33]:
df.replace(to_replace = 9,method='ffill')

C:\Users\HP\AppData\Local\Temp\ipykernel_21308\129647226.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace(to_replace = 9,method='ffill')

   roll no  maths  physics  chemistry
0        1   50.0      NaN        5.0
1        2   53.0      2.0        6.0
2        3    6.0      6.0        3.0
3        4    6.0      NaN       41.0
4        5   45.0      8.0        2.0
5        6   23.0      NaN        NaN
6        7    NaN      NaN        NaN
7        8   69.0     41.0        6.0
8        8    5.0     26.0        5.0
9       10    6.0      NaN       12.0

In [47]:
#part7  loc() and iloc()
df = pd.read_csv(r"C:\Users\HP\Downloads\Book2.csv",index_col = ['roll no'])
df

        section  maths  physics  chemistry    DOB branch
roll no
1             a   50.0      NaN        5.0  6-Apr     CE
2             a   53.0      2.0        6.0  5-May    CSE
3             c    6.0      6.0        3.0  6-May     IT
4             b    9.0      NaN       41.0  8-Jul    NaN
5             c   45.0      8.0        2.0  5-Dec     ME
6             b   23.0      NaN        NaN  6-Dec     EC
7             d    NaN      9.0        NaN  6-Mar     EE
8             b   69.0     41.0        6.0  6-May    BSC
9             a    5.0     26.0        5.0  9-Apr    NaN
10            c    6.0      NaN       12.0  1-Feb   AIML

In [43]:
df.loc(1)
df

         roll no  maths  physics  chemistry    DOB branch
section
a              1   50.0      NaN        5.0  6-Apr     CE
a              2   53.0      2.0        6.0  5-May    CSE
c              3    6.0      6.0        3.0  6-May     IT
b              4    9.0      NaN       41.0  8-Jul    NaN
c              5   45.0      8.0        2.0  5-Dec     ME
b              6   23.0      NaN        NaN  6-Dec     EC
d              7    NaN      9.0        NaN  6-Mar     EE
b              8   69.0     41.0        6.0  6-May    BSC
a              9    5.0     26.0        5.0  9-Apr    NaN
c             10    6.0      NaN       12.0  1-Feb   AIML

In [36]:
df.head()

   roll no section  maths  physics  chemistry    DOB branch
0        1       a   50.0      NaN        5.0  6-Apr     CE
1        2       a   53.0      2.0        6.0  5-May    CSE
2        3       c    6.0      6.0        3.0  6-May     IT
3        4       b    9.0      NaN       41.0  8-Jul    NaN
4        5       c   45.0      8.0        2.0  5-Dec     ME

In [50]:
df.loc[1]

section          a
maths         50.0
physics        NaN
chemistry      5.0
DOB          6-Apr
branch          CE
Name: 1, dtype: object

In [51]:
df.loc[5]

section          c
maths         45.0
physics        8.0
chemistry      2.0
DOB          5-Dec
branch          ME
Name: 5, dtype: object

In [52]:
df.loc[[5,6,7,8]]

        section  maths  physics  chemistry    DOB branch
roll no
5             c   45.0      8.0        2.0  5-Dec     ME
6             b   23.0      NaN        NaN  6-Dec     EC
7             d    NaN      9.0        NaN  6-Mar     EE
8             b   69.0     41.0        6.0  6-May    BSC

In [53]:
df.loc[5,'maths']

np.float64(45.0)

In [54]:
df.loc[5:10,'maths']

roll no
5     45.0
6     23.0
7      NaN
8     69.0
9      5.0
10     6.0
Name: maths, dtype: float64

In [55]:
df.loc[df['maths']>50]

        section  maths  physics  chemistry    DOB branch
roll no
2             a   53.0      2.0        6.0  5-May    CSE
8             b   69.0     41.0        6.0  6-May    BSC

In [56]:
df.loc[df['maths']>50,'chemistry']

roll no
2    6.0
8    6.0
Name: chemistry, dtype: float64

In [58]:
#iloc()

df.iloc[0]

section          a
maths         50.0
physics        NaN
chemistry      5.0
DOB          6-Apr
branch          CE
Name: 1, dtype: object

In [59]:
df.iloc[[0,1,2]]

        section  maths  physics  chemistry    DOB branch
roll no
1             a   50.0      NaN        5.0  6-Apr     CE
2             a   53.0      2.0        6.0  5-May    CSE
3             c    6.0      6.0        3.0  6-May     IT

In [63]:
df.iloc[:,1]

roll no
1     50.0
2     53.0
3      6.0
4      9.0
5     45.0
6     23.0
7      NaN
8     69.0
9      5.0
10     6.0
Name: maths, dtype: float64

In [64]:
df.iloc[0:5,0:5]

        section  maths  physics  chemistry    DOB
roll no
1             a   50.0      NaN        5.0  6-Apr
2             a   53.0      2.0        6.0  5-May
3             c    6.0      6.0        3.0  6-May
4             b    9.0      NaN       41.0  8-Jul
5             c   45.0      8.0        2.0  5-Dec

In [66]:
# part 8 groupby() and merege()
#part7  loc() and iloc()
df = pd.read_csv(r"C:\Users\HP\Downloads\Book2.csv")
df

   roll no section  maths  physics  chemistry    DOB branch
0        1       a   50.0      NaN        5.0  6-Apr     CE
1        2       a   53.0      2.0        6.0  5-May    CSE
2        3       c    6.0      6.0        3.0  6-May     IT
3        4       b    9.0      NaN       41.0  8-Jul     CE
4        5       c   45.0      8.0        2.0  5-Dec     ME
5        6       b   23.0      NaN        NaN  6-Dec     EC
6        7       d    NaN      9.0        NaN  6-Mar     EE
7        8       b   69.0     41.0        6.0  6-May     IT
8        9       a    5.0     26.0        5.0  9-Apr     IT
9       10       c    6.0      NaN       12.0  1-Feb   AIML

In [67]:
branch_group = df.groupby('branch')
branch_group

In [68]:
branch_group.groups

{'AIML': [9], 'CE': [0, 3], 'CSE': [1], 'EC': [5], 'EE': [6], 'IT': [2, 7, 8], 'ME': [4]}

In [71]:
branch_group=df.groupby(by = ['branch','section'])
branch_group.groups

{('AIML', 'c'): [9], ('CE', 'a'): [0], ('CE', 'b'): [3], ('CSE', 'a'): [1], ('EC', 'b'): [5], ('EE', 'd'): [6], ('IT', 'a'): [8], ('IT', 'b'): [7], ('IT', 'c'): [2], ('ME', 'c'): [4]}

In [72]:
for group ,data_frame in branch_group:
    print(group)
    print(data_frame)

('AIML', 'c')
   roll no section  maths  physics  chemistry    DOB branch
9       10       c    6.0      NaN       12.0  1-Feb   AIML
('CE', 'a')
   roll no section  maths  physics  chemistry    DOB branch
0        1       a   50.0      NaN        5.0  6-Apr     CE
('CE', 'b')
   roll no section  maths  physics  chemistry    DOB branch
3        4       b    9.0      NaN       41.0  8-Jul     CE
('CSE', 'a')
   roll no section  maths  physics  chemistry    DOB branch
1        2       a   53.0      2.0        6.0  5-May    CSE
('EC', 'b')
   roll no section  maths  physics  chemistry    DOB branch
5        6       b   23.0      NaN        NaN  6-Dec     EC
('EE', 'd')
   roll no section  maths  physics  chemistry    DOB branch
6        7       d    NaN      9.0        NaN  6-Mar     EE
('IT', 'a')
   roll no section  maths  physics  chemistry    DOB branch
8        9       a    5.0     26.0        5.0  9-Apr     IT
('IT', 'b')
   roll no section  maths  physics  chemistry    DOB branch
7        8       b   69.0     41.0        6.0  6-May     IT
('IT', 'c')
   roll no section  maths  physics  chemistry    DOB branch
2        3       c    6.0      6.0        3.0  6-May     IT
('ME', 'c')
   roll no section  maths  physics  chemistry    DOB branch
4        5       c   45.0      8.0        2.0  5-Dec     ME

In [75]:
#merege()

df1 = pd.DataFrame({'roll no':[1,2,3,4,5],'maths':[10,20,30,40,50]})
df1

   roll no  maths
0        1     10
1        2     20
2        3     30
3        4     40
4        5     50

In [76]:
df2 = pd.DataFrame({'roll no':[1,2,3,4,5],'physics':[10,20,30,40,50]})
df2

   roll no  physics
0        1       10
1        2       20
2        3       30
3        4       40
4        5       50

In [78]:
pd.merge(df1,df2,on='roll no')

   roll no  maths  physics
0        1     10       10
1        2     20       20
2        3     30       30
3        4     40       40
4        5     50       50

In [80]:
pd.merge(df2,df1,on='roll no')

   roll no  physics  maths
0        1       10     10
1        2       20     20
2        3       30     30
3        4       40     40
4        5       50     50

In [81]:
pd.merge(df1,df2)

   roll no  maths  physics
0        1     10       10
1        2     20       20
2        3     30       30
3        4     40       40
4        5     50       50

In [82]:
df3 = pd.DataFrame({'roll no ': [1,2,3,4,5],'maths':[10,20,30,40,50]})
df4 = pd.DataFrame({'roll no ': [1,2,9,10,11],'physics':[10,20,30,40,50]})

In [83]:
pd.merge(df3,df4)

   roll no   maths  physics
0         1     10       10
1         2     20       20

In [84]:
pd.merge(df3,df4,how='left')

   roll no   maths  physics
0         1     10     10.0
1         2     20     20.0
2         3     30      NaN
3         4     40      NaN
4         5     50      NaN

In [85]:
pd.merge(df3,df4,how='right')

   roll no   maths  physics
0         1   10.0       10
1         2   20.0       20
2         9    NaN       30
3        10    NaN       40
4        11    NaN       50

In [86]:
pd.merge(df3,df4,how='outer')

   roll no   maths  physics
0         1   10.0     10.0
1         2   20.0     20.0
2         3   30.0      NaN
3         4   40.0      NaN
4         5   50.0      NaN
5         9    NaN     30.0
6        10    NaN     40.0
7        11    NaN     50.0

In [87]:
pd.merge(df3,df4,how='inner')

   roll no   maths  physics
0         1     10       10
1         2     20       20

In [89]:
# part9 append()
df1 = pd.DataFrame({'roll no': [1,2,3,4,5],'maths':[10,20,30,40,50],'physics':[10,20,30,40,50],'chemistry':[10,20,30,40,50]})
df2 = pd.DataFrame({'roll no': [6,7,8,9,10],'maths':[10,20,30,40,50],'physics':[10,20,30,40,50],'chemistry':[10,20,30,40,50]})
print(df1)
print(df2)

   roll no  maths  physics  chemistry
0        1     10       10         10
1        2     20       20         20
2        3     30       30         30
3        4     40       40         40
4        5     50       50         50
   roll no  maths  physics  chemistry
0        6     10       10         10
1        7     20       20         20
2        8     30       30         30
3        9     40       40         40
4       10     50       50         50

In [92]:
df1._append(df2)

   roll no  maths  physics  chemistry
0        1     10       10         10
1        2     20       20         20
2        3     30       30         30
3        4     40       40         40
4        5     50       50         50
0        6     10       10         10
1        7     20       20         20
2        8     30       30         30
3        9     40       40         40
4       10     50       50         50

In [93]:
df2._append(df1)

   roll no  maths  physics  chemistry
0        6     10       10         10
1        7     20       20         20
2        8     30       30         30
3        9     40       40         40
4       10     50       50         50
0        1     10       10         10
1        2     20       20         20
2        3     30       30         30
3        4     40       40         40
4        5     50       50         50

In [94]:
df2._append(df1,ignore_index=True)

   roll no  maths  physics  chemistry
0        6     10       10         10
1        7     20       20         20
2        8     30       30         30
3        9     40       40         40
4       10     50       50         50
5        1     10       10         10
6        2     20       20         20
7        3     30       30         30
8        4     40       40         40
9        5     50       50         50

In [95]:
df2._append(df1,ignore_index=True,sort=True)

   chemistry  maths  physics  roll no
0         10     10       10        6
1         20     20       20        7
2         30     30       30        8
3         40     40       40        9
4         50     50       50       10
5         10     10       10        1
6         20     20       20        2
7         30     30       30        3
8         40     40       40        4
9         50     50       50        5

In [98]:
#part10 Pivot table

df = pd.read_csv(r"C:\Users\HP\Downloads\Book2.csv")

df

   roll no section  maths  physics  chemistry    DOB branch
0        1       a   50.0      NaN        5.0  6-Apr     CE
1        2       a   53.0      2.0        6.0  5-May    CSE
2        3       c    6.0      6.0        3.0  6-May     IT
3        4       b    9.0      NaN       41.0  8-Jul     CE
4        5       c   45.0      8.0        2.0  5-Dec     ME
5        6       b   23.0      NaN        NaN  6-Dec     EC
6        7       d    NaN      9.0        NaN  6-Mar     EE
7        8       b   69.0     41.0        6.0  6-May     IT
8        9       a    5.0     26.0        5.0  9-Apr     IT
9       10       c    6.0      NaN       12.0  1-Feb   AIML

In [105]:
 pd.pivot_table(df,index='branch',aggfunc='sum')

                    DOB  chemistry  maths  physics  roll no section
branch
AIML              1-Feb       12.0    6.0      0.0       10       c
CE           6-Apr8-Jul       46.0   59.0      0.0        5      ab
CSE               5-May        6.0   53.0      2.0        2       a
EC                6-Dec        0.0   23.0      0.0        6       b
EE                6-Mar        0.0    0.0      9.0        7       d
IT      6-May6-May9-Apr       14.0   80.0     73.0       20     cba
ME                5-Dec        2.0   45.0      8.0        5       c

In [106]:
 pd.pivot_table(df,index='branch',aggfunc='count')

        DOB  chemistry  maths  physics  roll no  section
branch
AIML      1          1      1        0        1        1
CE        2          2      2        0        2        2
CSE       1          1      1        1        1        1
EC        1          0      1        0        1        1
EE        1          0      0        1        1        1
IT        3          3      3        3        3        3
ME        1          1      1        1        1        1

In [107]:
 pd.pivot_table(df,index='branch',aggfunc='max')

          DOB  chemistry  maths  physics  roll no section
branch
AIML    1-Feb       12.0    6.0      NaN       10       c
CE      8-Jul       41.0   50.0      NaN        4       b
CSE     5-May        6.0   53.0      2.0        2       a
EC      6-Dec        NaN   23.0      NaN        6       b
EE      6-Mar        NaN    NaN      9.0        7       d
IT      9-Apr        6.0   69.0     41.0        9       c
ME      5-Dec        2.0   45.0      8.0        5       c

In [109]:
 pd.pivot_table(df,index='branch',columns='section')

TypeError: agg function failed [how->mean,dtype->object]